# Brewfile for dotfiles-rafli
# Install with: brew bundle install

# Taps
tap "homebrew/services"
tap "nikitabobko/tap"
tap "felixkratz/formulae"

# Core development tools
brew "neovim"
brew "tmux"
brew "zsh"

# Terminal and shell enhancements
brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Window management
cask "nikitabobko/tap/aerospace"

# Applications
cask "ghostty"
cask "raycast"

# SketchyBar status bar
brew "felixkratz/formulae/sketchybar"

# Additional useful tools for development
brew "git"
brew "gh"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "fzf"
brew "zoxide"

# Language servers and formatters (for Neovim)
brew "lua-language-server"
brew "stylua"
brew "tree-sitter"

# Optional: Additional development tools
# Uncomment as needed
# brew "node"
# brew "python"
# brew "rust"
# brew "go"